# Stage 5: Ensemble — CPU preprocessing + GPU inference pipelined.
# 4 CPU preprocess instances feed 2 GPU infer instances.
# Triton overlaps preprocessing of request N+1 with GPU work on request N.
name: "mobile_sam_ensemble"
platform: "ensemble"
max_batch_size: 0

input [
  { name: "INPUT_IMAGE" data_type: TYPE_STRING dims: [1] },
  { name: "BBOX"        data_type: TYPE_FP32   dims: [4] }
]

output [
  { name: "MASK"       data_type: TYPE_STRING dims: [1] },
  { name: "ENCODER_MS" data_type: TYPE_FP32   dims: [1] },
  { name: "DECODER_MS" data_type: TYPE_FP32   dims: [1] }
]

ensemble_scheduling {
  step [
    {
      model_name: "mobile_sam_preprocess"
      model_version: -1
      input_map  { key: "INPUT_IMAGE" value: "INPUT_IMAGE" }
      input_map  { key: "BBOX"        value: "BBOX"        }
      output_map { key: "IMAGE_TENSOR" value: "image_tensor" }
      output_map { key: "POINT_COORDS" value: "point_coords" }
      output_map { key: "POINT_LABELS" value: "point_labels" }
      output_map { key: "ORIG_SIZE"    value: "orig_size"    }
    },
    {
      model_name: "mobile_sam_infer"
      model_version: -1
      input_map  { key: "IMAGE_TENSOR" value: "image_tensor" }
      input_map  { key: "POINT_COORDS" value: "point_coords" }
      input_map  { key: "POINT_LABELS" value: "point_labels" }
      input_map  { key: "ORIG_SIZE"    value: "orig_size"    }
      output_map { key: "MASK"       value: "MASK"       }
      output_map { key: "ENCODER_MS" value: "ENCODER_MS" }
      output_map { key: "DECODER_MS" value: "DECODER_MS" }
    }
  ]
}
